# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/node'
tap 'homebrew/python'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'yarn'

# Apps
cask '1password'
brew '1password-cli'
cask 'docker'
cask 'figma'
cask 'github'
cask 'httpie'
cask 'imageoptim'
cask 'loom'
#cask 'pastebot'
#cask 'screen-studio'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
# cask 'tinkerwell' - php
# cask 'transmit' ftp
# cask 'tunnelbear' vpn
# cask 'tuple' screen share

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984
mas 'Speedtest', id: 1153157709
mas 'Spring', id: 1508706541
mas 'Remarkable Desktop', id:1276493162
